# Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов. 
# Программа должна работать следующим образом:
# 1. В начале у пользователя запрашивается количество билетов, которые он хочет приобрести на мероприятие.
# 2. Далее для каждого билета запрашивается возраст посетителя,
# в соответствии со значением которого выбирается стоимость:
# Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
# От 18 до 25 лет — 990 руб.
# От 25 лет — полная стоимость 1390 руб.
# 3. В результате программы выводится сумма к оплате. 
# При этом, если человек регистрирует больше трёх человек на конференцию,
# то дополнительно получает 10% скидку на полную стоимость заказа.

n = int(input('Укажите общее количество билетов '))
child = 0
teen = 0
adult = 0
price_teen = 990
price_adult = 1390
total_bill  = 0 
for i in range(n):
    age = int(input('введите возраст посетителя'))
    if age >= 25:
        adult = adult + 1
    elif age < 18:
        child = child + 1
    else: teen = teen + 1

total_bill = adult * price_adult + price_teen * teen

if n > 3:
    total_bill = total_bill * 0.9
    print('скидка 10%')

print('количество взрослых', adult)
print('количество подростков', teen)
print('количество детей', child)
print('сумма к оплате', total_bill)
